{
    "data": [{
            "title": "Breaking the Ice (Kasa Games)",
            "date": "February 26, 2023",
            "descriptions": "Starting a conversation with a stranger can be a daunting experience, especially if you're attracted to the person. But fear not - in this episode, the tribe is here to help you break the ice and strike up memorable conversations with anyone you meet! We begin by exploring some of our favorite icebreakers and conversation starters, designed to get you comfortable with starting conversations with strangers. From clever pick-up lines to thoughtful questions, we share our tried-and-true strategies for sparking engaging and memorable interactions. But that's not all - we also play another round of Kasa Games, our signature game that's all about connecting and having fun. Through various scenarios and challenges, we put our conversation skills to the test and work on improving our ability to connect with others in meaningful ways. Whether you're looking to break the ice with a potential love interest, make new friends, or simply improve your conversation skills, this episode has something for you. Join us for a fun and informative discussion on icebreakers, conversation starters, and Kasa Games, and remember to subscribe to our podcast for more exciting content. Follow us on social media for updates on our latest episodes and exclusive content",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/N2VkNGUwZjktMWQyYS00YjI1LTgxNjktNTc0YmZhOGY4ODI2?sa=X&ved=2ahUKEwjv8J3Bi7b9AhV0ticCHbSgAjEQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/5J4QLW2xq7eMWZ4NG3d2G6",
                "applePodcast": "https://podcasts.apple.com/us/podcast/79-breaking-the-ice-kasa-games/id1553517709?i=1000601907167",
                "youtube": "https://www.youtube.com/watch?v=JJffM59fFPw"
            }
        },
        {
            "title": "Humanity and Artificial intelligence",
            "date": "February 19, 2023",
            "descriptions": "The tribe dives into the rollout of artificial intelligence-augmented browsers by Microsoft, with the 'new bing' causing a lot of confusion and questions around the true capabilities of AI. We discuss some of the stories that have developed this week and offer our take on the possible causes of these flaws.As we explore the topic of artificial intelligence, we also touch on the importance of humanizing these technologies and understanding users' role in training chatbots and other AI systems. We discuss how to see and relate to these chatbots in a productive way.Whether you're a tech enthusiast, a skeptic of AI, or simply interested in the latest trends and developments in technology, this episode has something for you. Join us for a thought-provoking discussion on the intersection of human and artificial intelligence,and don't forget to subscribe to our podcast for more informative and entertaining content.",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MWIyNzYxNmMtZTYzYy00MTVlLTgzMWUtYmI3ZDQ5MzY5ZDg5?sa=X&ved=0CAUQkfYCahcKEwjIv_Om6KP9AhUAAAAAHQAAAAAQBQ",
                "spotify": "https://open.spotify.com/episode/2mo6vpo5xriFhzJGNaWCPn",
                "applePodcast": "https://podcasts.apple.com/us/podcast/78-humanity-and-artificial-intelligence/id1553517709?i=1000600442439",
                "youtube": "https://www.youtube.com/watch?v=J1xD2zRrdKk"
            }
        }, {
            "title": " Exploring the Intersection of Internet Security and Artificial Intelligence",
            "date": "February 14, 2023",
            "descriptions": "In this episode, the tribe dives into the complex and rapidly evolving world of internet security and artificial intelligence, exploring the latest advancements in AI technology and their impact on online safety. We analyze AI's potential risks and benefits and offer insights into how individuals and organizations can protect themselves in the digital age. We discuss the role of AI in detecting and mitigating cyber threats, as well as the potential risks of AI-powered attacks and surveillance. We also offer practical tips for safeguarding your online activity, from using strong passwords to adopting multi-factor authentication. Whether you're a tech enthusiast or simply concerned about online security, this video will provide you with valuable insights and thought-provoking ideas on the intersection of technology and privacy. Don't forget to subscribe to our channel for more discussions on internet security, artificial intelligence, and emerging technologies. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ODA5NzE0ZjctNjk1Yi00ZTNkLWIwNzItODkxMDY0ZDE5ZDBm?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/7Fds2FZxYtFrcunV2YQ2Wi",
                "applePodcast": "https://podcasts.apple.com/us/podcast/77-exploring-the-intersection-of-internet/id1553517709?i=1000599604132"
            }
        },
        {
            "title": " Privacy vs. Transparency: Striking a Balance in the Age of Data Collection",
            "date": "February 14, 2023",
            "descriptions": "In today's world, technology has made it easier for governments and corporations to collect data on individuals, raising questions about the balance between privacy and transparency. In this video, the tribe delves into this contentious topic, exploring the various facets of the issue and offering insights into how we can strike a balance between the need for privacy and the desire for transparency. We discuss the implications of government surveillance and data privacy regulations, as well as the responsibility of corporations in protecting user data. We also provide practical tips for protecting your privacy in the digital age, including using encryption tools and being mindful of your online activity. Whether you're concerned about privacy violations or interested in the broader implications of data collection, this video will provide you with valuable insights and practical solutions for navigating this complex issue. Don't forget to subscribe to our channel for more discussions on technology, ethics, and personal growth. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YzA1OWI1NzUtYzAwZC00NjRkLTgxMzAtMDk4MTg0ODdkMmVh?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/7nc8QXarn5sBoCoUTpYX6d",
                "applePodcast": "https://podcasts.apple.com/us/podcast/76-privacy-vs-transparency-striking-a-balance-in/id1553517709?i=1000599602119"
            }
        },
        {
            "title": " Why Millennials Are Delaying Settling Down: The Role of Education, Economics, and Shame",
            "date": "February 03, 2023",
            "descriptions": "Are millennials really falling behind in hitting social milestones like settling down? Our tribe believes there's more to the story. In this video, we continue the conversation on why millennials are delaying settling down and provide insights into the role of education, economics, and shame in this trend. From rising student debt to changing societal norms, there are many factors that are reshaping the way millennials approach relationships and family planning.We also discuss how shame and social pressure can impact a person's decision to settle down and start a family and offer strategies for overcoming these challenges. Whether you're a millennial or simply curious about this social issue, this video will provide you with valuable insights and practical advice to help you navigate the challenges of settling down in today's world. Don't forget to subscribe to our channel for more discussions on relationships, culture, and personal growth for millennials and beyond ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NmZkNTJmZmUtNjZmZC00ZjhmLWE0OTgtOTRiMTYzOTAxMWZl?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/7Hp4I4eWpSEvuI0o0x8vj9",
                "applePodcast": "https://podcasts.apple.com/us/podcast/75-why-millennials-are-delaying-settling-down-the/id1553517709?i=1000597907393"
            }
        },
        {
            "title": " Debunking the Myth: Why Millennials Want to Settle Down and Get Married",
            "date": "January 26, 2023",
            "descriptions": "Are millennials really averse to settling down and getting married? Our tribe thinks otherwise! In this video, we delve into the factors that fuel this myth and provide insights into why millennials are delaying marriage and committed relationships. From financial challenges to changing societal expectations, there are many reasons why millennials are approaching marriage differently than previous generations. We also address some of the other typical millennial stereotypes and provide a fresh perspective on the values and priorities of this unique generation. Whether you're a millennial yourself or simply curious about this social issue, this video will provide you with valuable insights and thought-provoking ideas. Don't forget to subscribe to our channel for more discussions on relationships, culture, and personal growth for millennials and beyond ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NjdmMjJhMTctNjgwYS00ZTBjLTg4ZDktZjk1MWI5MzAzNzNm?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/6RMXz9P84M93a6GqKni0hk",
                "applePodcast": "https://podcasts.apple.com/us/podcast/74-debunking-the-myth-why-millennials-want-to-settle/id1553517709?i=1000596795630"
            }
        },
        {
            "title": " The Upside of Stable Relationships: How to Build and Maintain Long-Lasting Connections",
            "date": "January 17, 2023",
            "descriptions": "Are stable relationships really all that boring? The tribe doesn't think so! In this video, we explore the benefits of stability in relationships and how they can actually be quite fulfilling and rewarding.From building trust and deeper connections to weathering the ups and downs of life together, there's so much to gain from long-lasting relationships. We also discuss how to build and maintain stable relationships, including communication tips, managing conflict, and prioritizing your partner.Whether you're single or in a relationship, this video will provide you with valuable insights and practical advice to help you create and sustain stable, meaningful connections. Don't forget to subscribe to our channel for more tips and insights on relationships and personal growth. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YzA4YjdiMmYtOWI5YS00MDAxLTg1OTAtZDJiNjJiNDdmZTI2?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/6IVjJXbFHcyNoKakNda52t",
                "applePodcast": "https://podcasts.apple.com/us/podcast/73-the-upside-of-stable-relationships-how-to/id1553517709?i=1000595026053"
            }
        },
        {
            "title": " Twiddle Time: Reacting to the Funniest Tweets on Twitter",
            "date": "January 10, 2023",
            "descriptions": "Join the tribe as we take a break from the daily grind and twiddle away on Twitter! In this episode, we share our reactions to the funniest tweets we find, keeping the new season light-hearted and fun before the proverbial rubber hits the road. From hilarious memes to witty one-liners, we've scoured Twitter for the best of the best to brighten your day. So sit back, relax, and join us for some good laughs and positive vibes. Don't forget to follow us on Twitter and subscribe to our channel for more fun-filled content! ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MmU3NmM2OGUtOWVkZS00N2RkLTk0ZDUtYmMxZTE0ZWJlZGQz?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/2DdNBy0XtXFGpp8GBYWzgh",
                "applePodcast": "https://podcasts.apple.com/us/podcast/72-twiddle-time-reacting-to-the-funniest-tweets-on-twitter/id1553517709?i=1000593568059"
            }
        },
        {
            "title": " Starting the New Year Strong: Our Goals and Aspirations",
            "date": "January 04, 2023",
            "descriptions": "The tribe kicks off the new year with a fresh start! In this video, the tribe discusses our goals and aspirations for the new year and how we plan to achieve them. As we embark on a new season, we're excited to share our journey with you and inspire you to start your own fresh start this year. Whether you're looking to improve your health, relationships, or career, this video will provide practical tips and insights to help you get started. Let's make the most of this new year and create the life we truly desire! Don't forget to subscribe to our channel for more inspiration and motivation to start the new year strong. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YzY2ZDVlZTQtZTczYi00ZWM0LThlMGYtM2YxZjk5YTFkY2Yw?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/5djvFWNd04KsiET6vx09ih",
                "applePodcast": "https://podcasts.apple.com/us/podcast/71-starting-the-new-year-strong-our-goals-and-aspirations/id1553517709?i=1000592510621"
            }
        },
        {
            "title": " The Year in Review: The Tribe's Season Finale Reflections on 2022",
            "date": "January 04, 2023",
            "descriptions": "In this season finale episode, The Tribe reflects on the year that was, discussing the good, the bad, and the memorable moments of 2022. We share our personal experiences and insights, offering a unique perspective on the events that shaped the year. We also discuss our plans for the new year, setting goals and sharing our hopes and dreams for the future. We give listeners a sneak peek into what they can expect from the next season of the podcast, promising even more insightful discussions on social issues, personal growth, and emerging trends. Whether you've been with us from the beginning or just tuning in, this season finale episode is a must-listen. Join us for a heartfelt reflection on the year that was and a glimpse into what's to come. Don't forget to subscribe to our podcast for more thought-provoking discussions, and follow us on social media for updates on our latest episodes and exclusive content. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YWEzNzczYmEtMGFkOC00Y2RjLTgzMmEtNzY3OTg5YzIyMzNl?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/56NKo3V0DyE7Fzm58N47dA",
                "applePodcast": "https://podcasts.apple.com/us/podcast/70-the-year-in-review-the-tribes-season/id1553517709?i=1000592510643"
            }
        },
        {
            "title": " Fun and Games",
            "date": "January 04, 2023",
            "descriptions": "n this episode, The Tribe engages in some lighthearted fun and games, starting with an edgy podcast game called '10 but...'. They dare to reveal as much in as few words as possible, resulting in a hilarious and revealing conversation. We then turn our attention to the world cup games, discussing the latest developments and sharing our predictions for the group stages and the ultimate winners. We cover everything from surprise upsets to standout performances in this lively discussion. Whether you're a sports fan, a fan of fun and games, or simply interested in the cultural forces that shape our world, this episode is a must-listen. Join us for an entertaining and insightful conversation on the world cup and more. Don't forget to subscribe to our podcast for more discussions on social issues, personal growth, and emerging trends. Follow us on social media for updates on our latest episodes and exclusive content. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MTRlYTlkY2ItNTYwZS00YmI0LTllNjUtYTQyOWEwM2U0ZDkx?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/4C3jNlwa0pDm8R3RrvQBVC",
                "applePodcast": "https://podcasts.apple.com/us/podcast/69-fun-and-games/id1553517709?i=1000592507891"
            }
        },
        {
            "title": " Why the Big Things Matter: The Tribe's Insights on the Role of Finance, Politics, and more.",
            "date": "November 07, 2022",
            "descriptions": "In this episode, The Tribe explores why the big things we hear on the news and around us are important. We discuss the role of finance, politics, sports, and other 'big concepts' in our daily lives and why they matter. The tribe offers insights into the ways in which these big things shape our society and the world at large, from the impact of finance on our personal finances to the role of politics in shaping our laws and regulations. We debate the possible outcomes of neglecting these areas in our daily lives and why they should not be ignored. Whether you're looking to improve your understanding of the big concepts that shape our society or simply gain a deeper appreciation for their impact on our daily lives, this episode is a must-listen. Join us for a thought-provoking conversation about why the big things matter. Don't forget to subscribe to our podcast for more discussions on social issues, personal growth, and emerging trends. Follow us on social media for updates on our latest episodes and exclusive content. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NzIzZDM3MzgtZTBjYy00OTZkLThmZDYtOTMxMTVlYTIzMjAz?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/3WPiGDdGjL6uyS1TqTp30y",
                "applePodcast": "https://podcasts.apple.com/us/podcast/68-why-the-big-things-matter-the-tribes-insights-on/id1553517709?i=1000585368824"
            }
        },
        {
            "title": " The Future of Cancel Culture: The Tribe's Insights on Its Impacts and Next Steps",
            "date": "November 01, 2022",
            "descriptions": "In this episode, The Tribe continues the conversation on cancel culture, diving deeper into the impacts it has had and will have on society. We debate the future of the movement and the changes we want to see in the next iteration. They share their insights into cancel culture's complexities, discussing its impact on free speech, creativity, and individual expression. We discuss the potential benefits of cancel culture and its potential dangers and limitations. Whether you're a content creator, a social media user, or simply interested in the cultural forces that shape our society, this episode is a must-listen. Join us for a lively conversation about the future of cancel culture and the ways in which it can be reimagined to promote positive change. Don't forget to subscribe to our podcast for more discussions on social issues, personal growth, and emerging trends. Follow us on social media for updates on our latest episodes and exclusive content. --- This episode is sponso…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NGYwMDk1YjYtYzk3Ni00YTNjLTkzMzUtMjZmYzEwYmNiMGNl?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/15DTRb4E2bKWsso1SqwrKE",
                "applePodcast": "https://podcasts.apple.com/us/podcast/67-the-future-of-cancel-culture-the-tribes-insights/id1553517709?i=1000584693721"
            }
        },
        {
            "title": " Cancel Culture: The Tribe's Insights on Its Effects and Future",
            "date": "October 24, 2022",
            "descriptions": "In this episode, The Tribe explores cancel culture and its effects over the last few years. We discuss some of the famous cancel culture stories, the lessons that can be drawn from them, and the impact that cancel culture has on our society and the world at large. They offer insights into the complexities of cancel culture, from the role of social media in driving it to the effects it has on individuals and communities. We discuss the potential dangers of cancel culture and the ways in which it can stifle free speech and creativity. Whether you're a social media user, a content creator, or simply interested in the cultural forces that shape our society, this episode is a must-listen. Join us for a thought-provoking conversation about cancel culture and its role in shaping our future. Don't forget to subscribe to our podcast for more discussions on social issues, personal growth, and emerging trends. Follow us on social media for updates on our latest episodes and exclusive…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/OWYyODY2OGUtMDU5ZC00MzAyLThiZDYtNjE1ODAzYjQwMjM3?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/0yRN3TBUAq0BdB545IRncn",
                "applePodcast": "https://podcasts.apple.com/us/podcast/66-cancel-culture-the-tribes-insights-on-its-effects/id1553517709?i=1000583708137"
            }
        },
        {
            "title": " Redefining Respect: The Tribe's Insights on How Culture Shapes our Perceptions",
            "date": "October 11, 2022",
            "descriptions": "In this episode, The Tribe delves into the topic of respect and how culture and background shape our perceptions of it. We share our personal experiences and discuss how they have shaped our views on what constitutes respectful behavior. The tribe offers insights into the ways in which respect is changing in the modern world as we become more globally connected and diverse. From redefining traditional gender roles to challenging cultural norms, we discuss the nuances of respect in today's society. Whether you're looking to improve your communication skills or gain a deeper understanding of the cultural forces that shape our perceptions, this episode is a must-listen. Join us for a thought-provoking conversation about redefining respect and its role in building strong, healthy relationships. Don't forget to subscribe to our podcast for more discussions on social issues, personal growth, and emerging trends. Follow us on social media for updates on our latest episodes and exc…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MzgxOTMzNDQtMDllYy00ZGFhLWI3YmUtMTcxNmU4OWVlMmJk?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/0ebhLkwuXRgBVitjYCtyj2",
                "applePodcast": "https://podcasts.apple.com/us/podcast/65-redefining-respect-the-tribes-insights-on-how/id1553517709?i=1000582305728"
            }
        },
        {
            "title": " The Pros and Cons of Being Transparent: Insights from The Tribe",
            "date": "October 11, 2022",
            "descriptions": "In this episode, The Tribe explores the many sides of transparency. We share what we're transparent about and why, as well as the risks and unintended consequences associated with being transparent. The tribe offers valuable insights into the pros and cons of transparency, from its role in building trust and authenticity to how it can backfire and cause unintended harm. We offer practical tips and tricks for finding the right balance of transparency in your personal and professional life. Whether you're an entrepreneur, a public figure, or simply looking to improve your communication skills, this episode is a must-listen. Join us for a lively conversation about the nuances of transparency and how to navigate them in your relationships. Don't forget to subscribe to our podcast for more discussions on social issues, personal growth, and emerging trends. Follow us on social media for updates on our latest episodes and exclusive content. --- This episode is sponsored by · Anch…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ODE5Njc4NmQtODM2OS00MDYyLTllZGQtMjkyN2VjY2Y3Yjli?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/17DfU2NGErzfz7SEzcDsok",
                "applePodcast": "https://podcasts.apple.com/us/podcast/64-the-pros-and-cons-of-being-transparent/id1553517709?i=1000582305656"
            }
        },
        {
            "title": " Building Character: Lessons and Stories from The Tribe",
            "date": "October 11, 2022",
            "descriptions": "In this episode, The Tribe has a conversation about character and how to build a strong, resilient one. We share the stories that shaped who we are today and the lessons and keys we've gathered over the years. From the importance of integrity and honesty to the power of vulnerability and resilience, our expert guests offer valuable insights into cultivating a character that can withstand life's challenges. We share our personal experiences and provide practical tips on developing good habits and maintaining a positive attitude.Whether you're looking to improve your personal or professional life, this episode will provide you with valuable insights and thought-provoking ideas. Join us for a meaningful conversation about building character and becoming the best version of yourself. Don't forget to subscribe to our podcast for more discussions on social issues, personal growth, and emerging trends. Follow us on social media for updates on our latest episodes and exclusive con…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ZGVlMGYzYmQtZDlmNi00ZmQ5LWEyNmQtMGFjYTg3OWZlMDlm?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/5bAfokV8vgEMsQr1qcXq9c",
                "applePodcast": "https://podcasts.apple.com/us/podcast/63-building-character-lessons-and-stories-from-the-tribe/id1553517709?i=1000582302841"
            }
        },
        {
            "title": " Navigating the Finance Talk: Tips and Tricks from The Tribe",
            "date": "September 12, 2022",
            "descriptions": "In this episode, The Tribe continues the conversation on boundaries, discussing one of the most crucial topics in any relationship: finance. We explore when to have the finance talk with your partner, and how to approach the conversation in a way that's constructive and positive. Kwesi Frost, joins us for his first show and offers valuable tips and tricks for navigating the finance talk. From the dos and don'ts of discussing money to the importance of setting shared financial goals, we share our personal experiences and insights on how to build a strong financial foundation in your relationships. Whether you're a couple just starting out or looking to improve your financial communication skills, this episode is a must-listen. Join us for a lively conversation about finance and relationships. Don't forget to subscribe to our podcast for more discussions on social issues, personal growth, and emerging trends. Follow us on social media for updates on our latest episodes and ex…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MGFkM2M4ZDYtYzFkNC00NjdiLWJkNTItYmExZjJjZjk4N2Ux?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/3H5tThYQl01CA97KN5a7PB",
                "applePodcast": "https://podcasts.apple.com/us/podcast/62-navigating-the-finance-talk-tips-and-tricks/id1553517709?i=1000579244007"
            }
        },
        {
            "title": " Setting Boundaries in Relationships: The Tribe's Tips and Tricks",
            "date": "September 04, 2022",
            "descriptions": "In this episode, The Tribe dives into the topic of boundaries in relationships. We explore the questions that come up when discussing boundaries, including whether they're necessary when to set them, and how to communicate them effectively. The tribe shares their insights on the importance of setting healthy boundaries in relationships, from their role in building trust and respect to how they can help prevent misunderstandings and conflicts. We offer practical tips and tricks for communicating your boundaries to your partner and setting clear expectations for your relationship. Whether you're a seasoned couple or just starting out, this episode will provide valuable insights and thought-provoking ideas on setting boundaries and building strong, healthy relationships. Join us for a meaningful conversation about the importance of boundaries and how to navigate them in your relationships. Don't forget to subscribe to our podcast for more discussions on social issues, person…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NWY3MjUyMTktOGE2ZS00MDEwLTgwNjEtNDkwZTNmZjkzZmUx?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/7e6kdPmmHgQyqGAMYFWHV8",
                "applePodcast": "https://podcasts.apple.com/us/podcast/61-setting-boundaries-in-relationships-the-tribes/id1553517709?i=1000578345458"
            }
        },
        {
            "title": " Small Acts, Big Impact: The Little Things That Make a Difference in Relationships.",
            "date": "August 28, 2022",
            "descriptions": "Often, the small things make a big difference in relationships, whether romantic or otherwise. In this episode, The Tribe discusses the little things that can increase attraction and interest, as well as the overlooked issues that can turn into big problems down the line. Our expert guests share their insights on the little things that matter most in building strong, healthy relationships, from communication to kindness and self-care. We also offer practical tips and tricks that can go a long way in achieving success in the dating world.Whether you're single or coupled up, this episode will provide you with valuable insights and thought-provoking ideas on how to improve your relationships and increase your happiness. Join us for a lively conversation about the small acts that significantly impact our lives. Don't forget to subscribe to our podcast for more discussions on social issues, personal growth, and emerging trends. Follow us on social media for updates on our lat…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/OTU4YzM3ZTEtMTg1OC00MzRlLWI0ZTctZWRkZGVhMzRkNjU5?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/5ML27WdrrZQrSlvJ1Z9ngb",
                "applePodcast": "https://podcasts.apple.com/us/podcast/60-small-acts-big-impact-the-little-things-that-make/id1553517709?i=1000577600046"
            }
        },
        {
            "title": " Brain Teasers and Predictions: The Tribe's Trivia and Riddle Games (Kasa Games)",
            "date": "August 23, 2022",
            "descriptions": "In this episode, The Tribe takes a break from discussing social issues to play some brain teasers and predictions games. We play three rounds of trivia and riddle games, with the winner earning all the bragging rights and the chance to assign the loser a new nickname! From pop culture to general knowledge, our games are sure to test your wits and keep you on your toes. And if you're a fan of sports, don't miss our predictions for the next round of EPL games, as we discuss the latest developments in the Kasa FPL league. Whether you're a trivia buff or just looking for a fun break from the norm, this episode is a must-listen. Join us for a lively conversation filled with laughs, witty banter, and a healthy dose of friendly competition. Don't forget to subscribe to our podcast for more discussions on social issues, personal growth, and emerging trends. Follow us on social media for updates on our latest episodes and exclusive content.#Kasa #KasaPodcast --- This episode is sp…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MjE0NTdlOWMtZWQxNy00NjNiLWJjYzEtZDMxNjUzOWRlNjMz?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/0IlXfJuDmafMO52NDpz7FC",
                "applePodcast": "https://podcasts.apple.com/us/podcast/59-brain-teasers-and-predictions-the-tribes-trivia/id1553517709?i=1000577123901"
            }
        },
        {
            "title": " The Growth Mindset: Navigating the Path to Success",
            "date": "August 09, 2022",
            "descriptions": "Achieving success and personal growth requires a mindset open to change and continuous improvement. In this episode, The Tribe discusses how individuals grow and mature in their thoughts and beliefs, exploring the arenas that promote and inhibit this growth process. From the power of positive thinking to the pitfalls of fixed mindsets, our expert guests share their insights on the growth mindset and offer practical tips for developing it.We also dive into the 5 laws of stupidity, a thought-provoking concept that sheds light on the importance of critical thinking and self-awareness. Whether you're a student, professional, or simply looking to improve your mindset and achieve your goals, this episode will provide you with valuable insights and thought-provoking ideas. In addition, The Kasa FPL league has begun, and The Tribe invites listeners to join the league. So, tune in for a lively conversation about growth and the paths to success. Don't forget to subscribe to o…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ODAwNDllYTMtYmViNS00NzhhLWFiYWItZWRmYzNmYWVmMzg3?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/4s2YILGacpqSLMlLaZdYtt",
                "applePodcast": "https://podcasts.apple.com/us/podcast/58-the-growth-mindset-navigating-the-path-to-success/id1553517709?i=1000575548113"
            }
        },
        {
            "title": " Debating the G.O.A.Ts: Exploring Greatness Across Music, Movies, and Sports",
            "date": "August 04, 2022",
            "descriptions": "The conversation about the greatest of all time (G.O.A.T) is one that's always buzzing in almost every sphere of life.In this episode, The Tribe dives into the debate, exploring some of the most iconic figures in music, movies, and sports. From Beyonce to Michael Jordan, we discuss the qualities that make a true G.O.A.T. and offer insights into the impact these icons have had on their respective fields.Afia and Kwadwo share their perspectives on some of the most popular G.O.A.Ts out there and even rip into a few of the more controversial choices. Whether you're a die-hard fan or simply curious about the conversation, this episode is a must-listen.Join us for a lively debate on greatness and the qualities that define it across various disciplines. Don't forget to subscribe to our podcast for more conversations about pop culture, social issues, and personal growth.Follow us on social media for updates on our latest episodes and exclusive content.#Kasa #KasaPodca…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YWI5NjhkYWQtNzNmNC00NWNhLTk5NjAtMmY2MWJiMDQyMjUz?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/0vjOe0O14WtQOZ0RAY1ewI",
                "applePodcast": "https://podcasts.apple.com/us/podcast/57-debating-the-g-o-a-ts-exploring-greatness/id1553517709?i=1000575040062"
            }
        },
        {
            "title": " Gone Bananas: Exploring the Weirdest News Stories of the Week (Kasa games)",
            "date": "August 04, 2022",
            "descriptions": "In this episode, The Tribe dives into the world of the week's weirdest and wackiest news stories. From bizarre animal encounters to offbeat political scandals, we take a lighthearted look at the stories that have everyone talking. Our guests share their favorite news items of the week, racking up points and competing for Kasa merch. We offer commentary and insights on the stories, discussing the cultural and social implications of these strange and often hilarious tales. Whether you're looking for a break from the serious news cycle or love a good laugh, this episode is a must-listen. Join us for an entertaining and engaging conversation on the news stories that have gone bananas. Don't forget to subscribe to our podcast for more conversations about social issues, culture, and current events.Follow us on social media for updates on our latest episodes and exclusive content. --- This episode is sponsored by · Anchor: The easiest way to make a podcast. https://anchor.fm/…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YTYwZWUyYWUtMjE5NC00YTk5LWFhNmQtNmZjNTg4OTg2ZjA3?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/5rHt4lzw5Q7aLdoAXsrn0h",
                "applePodcast": "https://podcasts.apple.com/us/podcast/56-gone-bananas-exploring-the-weirdest-news-stories/id1553517709?i=1000575040036"
            }
        },
        {
            "title": " The New Normal: Exploring Social Debates in a Changing World",
            "date": "August 04, 2022",
            "descriptions": "In this episode, The Tribe tackles the social debates surrounding the new normal in a rapidly changing world. From gym etiquette to social media content creation, the advent of new technologies and social trends has created a shift in the social paradigm, leading to new debates and challenges. We discuss a range of issues, including the impact of social media on our relationships and mental health, the changing landscape of work and education, and the role of personal responsibility in navigating the new normal.Our guests offer insights and perspectives on approaching these debates with empathy, understanding, and respect. Whether you're a social media influencer or simply trying to find your place in a changing world, this episode will provide valuable insights and thought-provoking ideas on the social debates of the new normal.Join us for a dynamic conversation on the intersection of technology, culture, and personal values. Don't forget to subscribe to our podcast fo…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ZjQ2NjhlMTctYjZkNy00NTcyLTg5NjgtZjVhZmI3NzQwODhm?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/16vMJdOmo5fFH9J913VTeu",
                "applePodcast": "https://podcasts.apple.com/us/podcast/55-the-new-normal-exploring-social-debates-in/id1553517709?i=1000575038462"
            }
        },
        {
            "title": " Healthy Mind, Healthy Body: Navigating the World of Fitness and Wellness",
            "date": "July 05, 2022",
            "descriptions": "In this episode, The Tribe dives into the world of fitness and wellness, exploring the connection between physical health and mental and emotional well-being. We discuss strategies for feeding the mind and body, from nutrition to exercise and offer tips for maintaining healthy habits in a changing social landscape. Our guests share their insights on gym etiquette, workout routines, and mental health practices, offering practical tips and advice for staying healthy and thriving in all areas of life.We also discuss the challenges of balancing work, family, and personal goals and share our own experiences with finding a sustainable fitness routine.Whether you're a fitness enthusiast or simply looking to improve your overall health and well-being, this episode will provide you with valuable insights and inspiration. Join us for a thought-provoking conversation on the connection between a healthy mind and body.#Kasa #KasaPodcast #Gym #Healthy --- This episode is sponsored by…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NjcyODBjMWItNTdiOS00Y2FlLWI5OWEtYWNlY2VjODY5NmMx?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/1FEoIPCDfBVbJEW6rBFgFp",
                "applePodcast": "https://podcasts.apple.com/us/podcast/54-healthy-mind-healthy-body-navigating-the-world/id1553517709?i=1000568921857"
            }
        },
        {
            "title": " The Art of Connecting: Tips from a Professional People-Connector",
            "date": "July 05, 2022",
            "descriptions": "In this episode, The Tribe sits down with Jennifer, a professional people-connector, to learn about the art of connecting. Jennifer has built a successful career around bringing people together and facilitating opportunities, and she shares her insights and tips on how to be a great people-connector. We discuss the importance of empathy, active listening, and effective communication in building strong connections. Jennifer also shares her strategies for identifying and cultivating meaningful relationships and offers advice on how to navigate social situations with ease and confidence. Whether you're looking to build your personal or professional network, this episode will provide you with valuable insights and actionable tips for improving your connecting skills. Join us for an engaging conversation on the art of connecting and the power of meaningful relationships. Don't forget to subscribe to our podcast for more conversations about social issues and personal growth.F…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NTc1ODllZmEtM2M5MC00OTRmLWFlZjUtMjRkMDZhZjRiYjFl?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/3KnzNIvXF9MGWYDntTsZGA",
                "applePodcast": "https://podcasts.apple.com/us/podcast/53-the-art-of-connecting-tips-from-a/id1553517709?i=1000568922009"
            }
        },
        {
            "title": " Navigating the Fast-Paced World of Online Connections (Part 2)",
            "date": "June 30, 2022",
            "descriptions": "In the wake of a global pandemic, the internet has become an essential tool for connection and communication. But as the online world continues to evolve at breakneck speed, it can be challenging to keep up with the latest trends and best practices for establishing a strong internet presence. In this episode, The Tribe offers insights into how to survive and thrive in the fast-paced world of online connections. We discuss tools and strategies for growing your internet presence and networks, as well as the dos and don'ts of various social media platforms. From sharing personal experiences to offering practical tips, our guests provide a wealth of knowledge on establishing and maintaining strong online connections. We also share some funny stories of our social media interactions, highlighting the lighter side of the internet frenzy.Whether you're a digital native or a newcomer to the online world, this episode will provide valuable insights and thought-provoking ideas on n…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ZWUwYjRjOWItM2JhNC00MjVkLWIzODktMjEzNWQ3OTkyODQy?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/1yFql5LnYwzszI5RT6ynyC",
                "applePodcast": "https://podcasts.apple.com/us/podcast/52-navigating-the-fast-paced-world-of-online/id1553517709?i=1000568370801"
            }
        },
        {
            "title": " Navigating the Fast-Paced World of Online Connections",
            "date": "June 30, 2022",
            "descriptions": "In the wake of a global pandemic, the internet has become an essential tool for connection and communication. But as the online world continues to evolve at breakneck speed, it can be challenging to keep up with the latest trends and best practices for establishing a strong internet presence. In this episode, The Tribe offers insights into how to survive and thrive in the fast-paced world of online connections. We discuss tools and strategies for growing your internet presence and networks, as well as the dos and don'ts of various social media platforms.From sharing personal experiences to offering practical tips, our guests provide a wealth of knowledge on establishing and maintaining strong online connections. We also share some funny stories of our social media interactions, highlighting the lighter side of the internet frenzy. Whether you're a digital native or a newcomer to the online world, this episode will provide valuable insights and thought-provoking ideas on na…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ZjNjYTI1NTctNGExMS00OGNjLWFkYTMtMzk4ZTQwNWI0ODg0?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/7aFfFAsoo7ep7YuaQxqTYi",
                "applePodcast": "https://podcasts.apple.com/us/podcast/51-navigating-the-fast-paced-world-of-online-connections/id1553517709?i=1000568370959"
            }
        },
        {
            "title": " Celebrating Success: How to Make the Most of Your Wins",
            "date": "June 30, 2022",
            "descriptions": "In this special 50th episode of The Tribe podcast, we're talking about the power of celebration. From small wins to significant accomplishments, taking the time to acknowledge and savor our successes can be a powerful tool for motivation and growth.Our guests share their insights on cultivating a celebratory mindset and offer practical tips for making the most of your wins. We discuss the importance of reflection, gratitude, and positivity in the celebration process and share stories of how celebrating has propelled us toward even greater success.Whether you're struggling to find the motivation or simply looking for new ways to amplify your wins, this episode is a must-listen. Join us for an uplifting conversation about the importance of celebration and the impact it can have on our lives.Don't forget to subscribe to our podcast for more conversations about social issues and personal growth. Follow us on social media for updates on our latest episodes and exclusive conte…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MThiMmYxNzAtMDJkMi00Njg0LWFlYWItNzdlNmFlNDVjYjg2?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/0zg9r8moxoeiE4DKoLwhyy",
                "applePodcast": "https://podcasts.apple.com/us/podcast/50-celebrating-success-how-to-make-the-most-of-your-wins/id1553517709?i=1000568370960"
            }
        },
        {
            "title": " The Power of Vulnerability: Opening Up to Others",
            "date": "May 23, 2022",
            "descriptions": "In this episode, The Tribe explores the benefits and challenges of opening up to others. We discuss what to look for in a confidant and how to evaluate the impact of opening up on those around us. We also dive into the mental health benefits of vulnerability and encourage listeners to seek help when needed.From sharing personal stories to seeking advice, opening up can be a powerful tool for connection and growth. However, it can also be scary and overwhelming. Our expert guests share their insights on how to approach vulnerability with confidence and compassion and offer practical tips for cultivating strong and supportive relationships.Whether you're struggling with mental health issues, looking to deepen existing relationships, or simply curious about the power of vulnerability, this episode is a must-listen. Join us for candid conversation, expert advice, and a deeper understanding of the role of opening up in our lives.Don't forget to subscribe to our podcast for mo…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ZjNkNzIwMDktOWFlZC00Njc1LTk4ODQtMTdkMmE5ZTI2NjBh?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/4VZJcpyWcnKJlwthaxANRC",
                "applePodcast": "https://podcasts.apple.com/us/podcast/49-the-power-of-vulnerability-opening-up-to-others/id1553517709?i=1000563341636"
            }
        },
        {
            "title": " Navigating Tricky Topics on First Dates",
            "date": "May 16, 2022",
            "descriptions": "Are there bad questions to ask on a first date? Not necessarily, but some topics can be tricky to navigate. In this episode, The Tribe discusses questions and issues that may require extra tact to successfully navigate in the early stages of getting to know someone. We cover a range of topics, including politics, religion, ex-partners, and more. While these topics are not inherently bad, they can be off-putting or uncomfortable if not approached in the right way. We offer practical tips for managing these conversations, from finding common ground to setting boundaries.Whether you're a seasoned dater or just starting out, this episode will provide you with valuable insights on how to navigate tricky topics on first dates.Tune in for thoughtful discussion, witty commentary, and expert advice from The Tribe. Don't forget to subscribe to our podcast for more conversations about dating, relationships, and social issues. Follow us on social media for updates on our latest epis…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YjQ3YmIyODUtYWRlYy00MWE4LWE3OWQtNzZmYmVkYTkwYzEx?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/1xCBRgJas2IWjZzcRWSvEK",
                "applePodcast": "https://podcasts.apple.com/us/podcast/48-navigating-tricky-topics-on-first-dates/id1553517709?i=1000561639970"
            }
        },
        {
            "title": " Knowing your tribe",
            "date": "May 11, 2022",
            "descriptions": "Knowing your tribe is a series in which we get to know the cast of the Kasa Podcast. Today we get to know about Kwadwo.Afia asks all the questions we have a been thinking. Enjoy getting to know Kwadwo!!!#Kasa #KasaPodcast #Knowingyourtribe ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MWJmZjQyYjItN2QwZC00MjE2LTkxYWMtNmQ1NzI0ZGE2NGQ4?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/3beaRkzjpAIAOVi7s04vHj",
                "applePodcast": "https://podcasts.apple.com/us/podcast/47-knowing-your-tribe/id1553517709?i=1000560549722"
            }
        },
        {
            "title": " Summer movie recommendations",
            "date": "May 11, 2022",
            "descriptions": "It's almost Summer!!! And the tribe has a few summer movie recommendations for you!! The tribe goes through the 2022 movie release calendar from January to December and review the ones that have been released and also share their thoughts on the forthcoming ones. #Kasa #KasaPodcast #Movies #SummerMovieRecommendations Link to the other flix episodehttps://anchor.fm/kasathetribe/episodes/19--Summer-FLIX-e14fmbm ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ZjBhNzkzNWMtOWRmMy00YjA5LWEyZGMtNzM4NGFkOWQ2YmE3?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/6Q4ayV3xxaePaFGtwN2WKR",
                "applePodcast": "https://podcasts.apple.com/us/podcast/46-summer-movie-recommendations/id1553517709?i=1000560546915"
            }
        },
        {
            "title": " It is Prime Time!!!!",
            "date": "May 11, 2022",
            "descriptions": "The tribe spends some time with one of the most influential members of the tribe in Prime Time!!! Prime has several stories and lessons on starting business both in and out of Ghana, managing finance, building connections, and a whole lot of basketball!!! The conversation with Prime touches on all these areas of his interest and knowledge and is aimed at sharing the lessons learnt over the year with the Tribe! #Kasa #KasaPodcast #PrimeTime #Time ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YTYzNDUxZTItNmU1Ny00ZDBkLWEwNTAtYzMwZTgyYzc5ZDYz?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/0SdOVgaLYws6qQbUjc4cHk",
                "applePodcast": "https://podcasts.apple.com/us/podcast/45-it-is-prime-time/id1553517709?i=1000560545464"
            }
        },
        {
            "title": " Let's go see the World cup!!!",
            "date": "May 10, 2022",
            "descriptions": "The World cup is upon us again!!! The Qatar 2022 World cup draw was help in Doha and the Tribe is making plans to go see the games already. The tribe talks about the World Cup qualifiers, the draw and the tournament expectations. They then get into how they are planning to head to the World Cup games. They provide a step-by-step information piece to get you to Qatar!! #Kasa #KasaPodcast #WorldCup #Qatar2022 ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MzRkOWI2NmMtOGYwZS00MDc4LWIwZTEtZDAwN2YyOWNjN2Nj?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/44kj3zzy3OJF4uxCviLHDn",
                "applePodcast": "https://podcasts.apple.com/us/podcast/44-lets-go-see-the-world-cup/id1553517709?i=1000560367257"
            }
        },
        {
            "title": " 1 2 3 react",
            "date": "May 10, 2022",
            "descriptions": "The tribe reacts to the 3music awards and discuss the big winners, losers and all the snubs!!! They also use the 3 awards to predict the winners of the VGMA!! And it's Oscars night! a little flix conversation as lagniappe ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MjU2ZmQyZjktOGZlMi00ZDAzLWEwYmMtOGY3MDc4YTU3ODlm?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/0t8d32pV9l1roEjpOW9MTT",
                "applePodcast": "https://podcasts.apple.com/us/podcast/43-1-2-3-react/id1553517709?i=1000560362462"
            }
        },
        {
            "title": " Living away from home",
            "date": "May 10, 2022",
            "descriptions": "Living away from home can be very challenging for young adults. Whatever the reason may be, having to live by yourself away from home, family, and social support presents its own challenges. The tribe shares their experience living away from home. Their journeys, their expectations, the adjustments they made and the lessons they learned along the way. #Kasa #KasaPodcast #Livingawayfromhome ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NzY0ZWJiNzktYTJmYy00NTJiLWI5MWEtOGY3NTdkYzUwNjMw?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/513tOioDVYGUkBFLsB3eAT",
                "applePodcast": "https://podcasts.apple.com/us/podcast/42-living-away-from-home/id1553517709?i=1000560361638"
            }
        },
        {
            "title": " Kweku Ananse stories",
            "date": "March 17, 2022",
            "descriptions": "Kweku Ananse is a revered mythological character in Ghanaian folklore. The tribe gets into some of the famous stories told to Ghanaians as the grow up. The share the lessons from these stories and compete against each other for the crown of \"best story teller\". Get to know more about Kweku in this episode.#Kasa #KasaPodcast #KwekuAnanse #KwekuAnanseStories ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YjgyNmM4ZTEtNjk4My00Zjc1LTg5MjQtMjg3ZmQyOWQzZTQ0?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/63t45Z6NKOMsqhnryfXfmy",
                "applePodcast": "https://podcasts.apple.com/us/podcast/41-kweku-ananse-stories/id1553517709?i=1000554417688"
            }
        },
        {
            "title": " Stories of a Ghanaian child",
            "date": "March 17, 2022",
            "descriptions": "Every Ghanaian child has loads of stories. It is independence day in Ghana and the tribe shares their \"Ghanaian child\" stories. Stories about growing up, childhood games, Ghanaian food, Ghanaian tourist sites and all the various things they enjoyed growing up in Ghana. #Kasa #KasaPodcast #IndependenceDay #Ghana #Ghanaianchild ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MzM2MTRlOTgtZjQ1Ni00NWNhLTg0ZDctMDQ0NGQ1ZjFiN2Yz?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/3LVZYYplaXfsouLrkhschZ",
                "applePodcast": "https://podcasts.apple.com/us/podcast/40-stories-of-a-ghanaian-child/id1553517709?i=1000554416460"
            }
        },
        {
            "title": " High School days",
            "date": "March 17, 2022",
            "descriptions": "The tribe goes back to High School!!! They share their stories from the first day in high school till the last day! The fun stories, love stories, horror stories, regrettable moments, super zonals, Brilla, facing the bullies, and all other stories from High school.#KasaPodcast #Kasa #HighSchool ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NmUyNmNiZjItNDhhOC00YWYwLThlZmUtNWZkNzQ2MjcxMGQw?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/5flxZoEQTqzhyts1XgxqLL",
                "applePodcast": "https://podcasts.apple.com/us/podcast/39-high-school-days/id1553517709?i=1000554416461"
            }
        },
        {
            "title": " Were your expectations met?",
            "date": "March 17, 2022",
            "descriptions": "The tribe had loads of Expectations and plans for their Valentines day!! How did it all go for them? Were these expectations met? Did they get the gifts they wanted? Did it all go according to plan? Well, if it did not, how do they manage their expectations; for the next Vals day and life in general.#KasaPodcast #Kasa #Expectations ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/M2Q4YzU5MzMtOTRiMC00MTQ5LWJlOTMtOTAyMzA0MGE5NmRk?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/4HVkj6tR81fzZ0e2PPKl7k",
                "applePodcast": "https://podcasts.apple.com/us/podcast/38-were-your-expectations-met/id1553517709?i=1000554416436"
            }
        },
        {
            "title": " Let's talk Valentine",
            "date": "February 17, 2022",
            "descriptions": "It is Valentine day weekend!! The tribe shares all their Valentine's day plans and talk about the gifts they are giving out! They share some tips on classy, easy on the pocket, last minute valentines day gifts. They also get into the Super Bowl and make some predictions about the game, talk about the half time show and some of the commercials they are excited to see. #ValentinesDay #Valentine #Kasa #KasaPodcast---This episode is sponsored by· Anchor: The easiest way to make a podcast.  https://anchor.fm/app",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ODcyMDY4OGItZDYyNC00YzkyLTk5ODItN2M2MWIzYjNiOTQx?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/07R1i0GjCe13FqIcui0LDT",
                "applePodcast": "https://podcasts.apple.com/us/podcast/37-lets-talk-valentine/id1553517709?i=1000551361840"
            }
        },
        {
            "title": " Valentine's Day gifts/ideas to avoid",
            "date": "February 09, 2022",
            "descriptions": "Valentine's day is around the corner!! We are in the month of LOVE!!! Valentine's day is coming up and you might be struggling to get some fresh ideas to surprise your partner. Guess what, there are some gifts your partner would probably, like most of the tribe, not like!! Hahaha I might even be bold to say, they might HATE some of these gifts. Check out the tribe get into some of these ideas!!---This episode is sponsored by· Anchor: The easiest way to make a podcast.  https://anchor.fm/app",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/Y2VhYjk4MTItMjFlMS00MWJhLWE3MDctNmYxYjA1NjRiNGZm?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/3b7n8UtaRanQhNRE2eCjW5",
                "applePodcast": "https://podcasts.apple.com/us/podcast/36-valentines-day-gifts-ideas-to-avoid/id1553517709?i=1000550611454"
            }
        },
        {
            "title": " Books Books Books 2",
            "date": "February 08, 2022",
            "descriptions": "The tribe decided to read a lot more this year and the challenge has been on!! Books books books. 📚📚📚This episode explores the books the tribe has read so far in 2022 and their recommendations. They explore the books in details and tell a bit of the story to wet you reading appetite!! ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YTQyNDEzN2UtYjljOC00ZDU5LTk0MTctZjVkMjBlOWU5ZTQ2?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/5eYQ7nJckG2ouyOmYgTJag",
                "applePodcast": "https://podcasts.apple.com/us/podcast/35-books-books-books-2/id1553517709?i=1000550490671"
            }
        },
        {
            "title": " Turning failure into fuel for success",
            "date": "February 08, 2022",
            "descriptions": "The tribe talks about how to turn setbacks and failures into lessons and fuel on our journey to success. They share some tips that can be very useful in diagnosing situations and learning the most out of every missed opportunity to help better prepare yourself for the next one. The road to success is not a straight path and lessons missed can be costly down the line. #Success #KasaPodcast #Goals #FuelforSUCCESS ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ZTFjZjIxYTItYzQxMy00MTkyLWIyZDQtNzgwM2U4MTdlYWVh?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/0gyrum2E2UG2j3gJbm3CIu",
                "applePodcast": "https://podcasts.apple.com/us/podcast/34-turning-failure-into-fuel-for-success/id1553517709?i=1000550408754"
            }
        },
        {
            "title": " How to Create the Best Graduate School Application.",
            "date": "January 17, 2022",
            "descriptions": "In this episode, Kwadwo has a one-on-one chat with David Sobek, PhD on how to create the best application packet for graduate school in the US. David shares a wealth of knowledge and experience, offering tips and advice for crafting a strong statement of purpose and securing solid recommendations from professors.They also discuss some healthy habits and practices that can help students succeed in their graduate studies, from time management to stress management and more. And for some added fun and entertainment, we get into live-streaming games and some Fortnite action.Whether you're a prospective graduate student or simply interested in thought-provoking discussions and fun, engaging content, this episode has something for you. Join us for an insightful and entertaining conversation on graduate school applications and more, and don't forget to subscribe to our podcast for more informative and entertaining discussions. Follow us on social media for updates on our latest…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NTFkN2Y2MDEtOWMwYy00MDljLWE0NzYtMDFmNTRkMjBjZDU1?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/5GT58ZEu3qtha1EoXKjZH2",
                "applePodcast": "https://podcasts.apple.com/us/podcast/33-how-to-create-the-best-graduate-school-application/id1553517709?i=1000548173074"
            }
        },
        {
            "title": " Chasing goals",
            "date": "January 12, 2022",
            "descriptions": "The tribe gets into ways to hope achieve their new year goals!And share tips and tricks that they hope to use to get over the line!! They also get into conversations on the AFCON 2021 and Dee give her predictions for the first round of games.NAG drops an \"Andriod\" joke!!! ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NTU2NjFjNjUtYmIzNS00MDY4LWJjNTItY2RmMTJlOTQyMGM5?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/7qba7vR5DYOtyLFrj09ykk",
                "applePodcast": "https://podcasts.apple.com/us/podcast/32-chasing-goals/id1553517709?i=1000547724969"
            }
        },
        {
            "title": " New Year, New Tribe: The Tribe Returns for a Season of Reflection and Growth",
            "date": "January 10, 2022",
            "descriptions": "The Tribe is back for another season, and it's a new year with new opportunities for growth and reflection. In this episode, we get together to discuss some big questions for the new year, including our main targets, habits we want to get rid of, and what we're going to avoid in 2022. We share our personal insights and experiences, offering a unique perspective on the challenges and opportunities that lie ahead. Nag also shares some big revelations about perfection, inspiring us to let go of our unrealistic expectations and embrace our imperfections. Whether you're looking for motivation and inspiration in the new year or simply interested in thought-provoking discussions on social issues and personal growth, this episode is a must-listen. Join us for a new season of the podcast and a renewed commitment to personal and collective growth. Don't forget to subscribe to our podcast for more insightful discussions, and follow us on social media for updates on our latest episodes…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ZTdmZGY5MmQtMzIwNi00MWJkLWExN2MtZjU3YmUzYjI0MWMx?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/4u13TcdnMkdzSNGUi5hpwp",
                "applePodcast": "https://podcasts.apple.com/us/podcast/31-new-year-new-tribe-the-tribe-returns-for-a/id1553517709?i=1000547474540"
            }
        },
        {
            "title": " Season Finale",
            "date": "December 26, 2021",
            "descriptions": "The tribe wraps up 2021 and end the season with a review of the journey of the first season. The tribe talks about the highs and lows of the podcast journey and the lessons they learnt along the way.They also promise an even bigger season 2 which involve livestreams on Facebook and YouTube and hope to get a lot more audience engagements.The YouTube channel is @Kasa Podcast https://www.youtube.com/channel/UCGFnofILLEcUTy2s6hc1xCAhit that subscribe button and turn on your notifications!!! ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YzllZjFkYWUtMTE3Mi00NjVjLWFiZjEtYTY1NGZlMDRmYjAy?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/3le5V4uMCCBGUls0pQSqgx",
                "applePodcast": "https://podcasts.apple.com/us/podcast/30-season-finale/id1553517709?i=1000546157020"
            }
        },
        {
            "title": " Keep it fun; stay happy",
            "date": "November 21, 2021",
            "descriptions": "The tribe raise awareness on mental health as they celebrate the mental health awareness month. They also try to challenge listeners to go on \"happy journeys\". Wendy joins twitter (@sweetnanafr) and gets the guys on there fighting already.  ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NzIxODc3NDctMWUyOC00ZTc5LTkxYTctMmExNDYzOTNkZjI1?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/5OHs5qJtXxczdizQFD2liJ",
                "applePodcast": "https://podcasts.apple.com/us/podcast/29-keep-it-fun-stay-happy/id1553517709?i=1000542587438"
            }
        },
        {
            "title": " Friends or not?",
            "date": "October 25, 2021",
            "descriptions": "The tribe gets into how it's okay to drift apart from some friends when y'all in different seasons in life. This raises the question of which kinds of friends are okay to drift away from and which ones cannot fit the bill. Ekow raises the most delicate question of all \" Can boys and girls be friends?\". The tribe argue it out and finally get to two key answers........... ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MGEwOGY2MWYtMGFhOS00ZWU2LWJhZmItYjhmYjk5NzQ1Yzk3?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/5aqWr5yloMaFXJfQHR8hmq",
                "applePodcast": "https://podcasts.apple.com/us/podcast/28-friends-or-not/id1553517709?i=1000539587134"
            }
        },
        {
            "title": " The subtle art of ghosting",
            "date": "October 10, 2021",
            "descriptions": "The tribe gets into conversation on \"ghosting\" and \"airing\" in this fast-paced world. They come up with some reasons why people ghost and things that can reduce the chances of getting ghosted. Ekow attempts to snitch a little but Afia retains her crown by snitching on her dad! ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ZDhlMjlkYzctZjRiNS00YTFiLThkNWEtM2FhYzA5YTMyODAz?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/5Sus3dj6FOvwzuY93cDwTJ",
                "applePodcast": "https://podcasts.apple.com/us/podcast/27-the-subtle-art-of-ghosting/id1553517709?i=1000538138375"
            }
        },
        {
            "title": " Social media",
            "date": "October 09, 2021",
            "descriptions": "The tribe gets into conversations on the good, bad, and ails of social media. They get into some heartwarming stuff that happen on there and share some ideas on how to avoid the \"not so pleasant\" side of the medium. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/M2EwYmRiYzQtMjU0MS00ZTc4LTk5YmEtNTViMjlmMDFhOTg1?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/2AEIBGYKdKMAksQp7cqCzx",
                "applePodcast": "https://podcasts.apple.com/us/podcast/26-social-media/id1553517709?i=1000537066629"
            }
        },
        {
            "title": " Knowing me knowing you",
            "date": "September 24, 2021",
            "descriptions": "The tribe plays a game of questions and answers to get to know each other a little more. New tribe member, Wendy, gets her own baptism of fire as some questions get her in a tight spot and Ekow gets called out!!!The tribe drops the Twitter and IG handles again. Give them a followTwitter@Kasa_theTribe, @just_quajjo. @ephya_yeboah, @Papakow8Instagram@kasa_thetribe, @miss_afia_yeboah, @nanaekownyarkson, @sweet_nana_frSnapchat@just_quajjo, @nanayaaboateng ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NWI3NzBjOWItMzg4OS00MTI5LWIzOTUtYzQyYmMwOTgyOGRi?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/5tSiawFgEVVKAreYvzT69M",
                "applePodcast": "https://podcasts.apple.com/us/podcast/25-knowing-me-knowing-you/id1553517709?i=1000536543731"
            }
        },
        {
            "title": " Respect",
            "date": "September 16, 2021",
            "descriptions": "The Tribe gets into the question of whether respect is earned or given. Dede and Afia dive into a couple of rabbit holes while the boys try to keep up.Afia makes a prediction for the UEFA Champions League!!The tribe drops the Twitter and IG handles again. Give them a followTwitter@Kasa_theTribe, @just_quajjo. @ephya_yeboah, @Papakow8, @chris_kuetsinyaInstagram@dr.adote, @kasa_thetribe, @miss_afia_yeboah, @nanaekownyarkson, @chris_kuetsinya ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MDU5ZGZjODItN2VkMS00YzAyLTk5ZGYtMWRjZWE1Y2Y3NTkw?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/740dTae9OBeQdgwx6XoLNx",
                "applePodcast": "https://podcasts.apple.com/us/podcast/24-respect/id1553517709?i=1000535491935"
            }
        },
        {
            "title": " Red Flags",
            "date": "September 09, 2021",
            "descriptions": "the tribe gets into some attributes and traits they consider to be red flags in friendships, romantic relationships, school, and career paths. Dede drops an interesting though on \"masturbating the mind\" that gets everyone shocked and asking for more details on the thought.The tribe also drops the Twitter and IG handles again. Give them a followTwitter@Kasa_theTribe, @just_quajjo. @Papakow8, @chris_kuetsinya, @gistwithdeeInstagram@dr.adote, @kasa_thetribe, @nanaekownyarkson, @chris_kuetsinya @__efya__ ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ODg4OTI4MGEtMTFjMy00OWU0LWE5YTAtYWMwY2Q0MjlkYjBl?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/2In3xSkizqH2urPZStvQSI",
                "applePodcast": "https://podcasts.apple.com/us/podcast/23-red-flags/id1553517709?i=1000534787431"
            }
        },
        {
            "title": " Ready or Not?",
            "date": "August 26, 2021",
            "descriptions": "The Tribe gets ready for new challenges this fall and discuss tricks that helps you get ready in as short a time as possible. Dede joins the tribe and brings a lot of vibrance and wit ti the conversation. The tribe also drops the Twitter and IG handles again. Give them a followTwitter@Kasa_theTribe, @just_quajjo. @ephya_yeboah, @gistwithdeeInstagram@dr.adote, @kasa_thetribe, @miss_afia_yeboah, @__efya__ ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YzA2M2ZmMjgtZTY0OS00NWJjLWJkNDAtNjMxNDQxOTU4NWE0?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/7m6BBeyamw7xvgwgaCtiyJ",
                "applePodcast": "https://podcasts.apple.com/us/podcast/22-ready-or-not/id1553517709?i=1000533157824"
            }
        },
        {
            "title": " Little things - part 2",
            "date": "July 29, 2021",
            "descriptions": "The tribe continues the conversation on the little things that make a big difference. They get into first impressions, fashion, and education. Afia also asks for help with a DJ name. Share your suggestions on all the social media platforms. Enjoy!!! ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YjI1YWYwZTAtOGI5NS00NTM0LThlZmQtMTMxMjBjMmVjZDAz?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/6aByTTh8gj5v2T3npC33oS",
                "applePodcast": "https://podcasts.apple.com/us/podcast/21-little-things-part-2/id1553517709?i=1000530435298"
            }
        },
        {
            "title": " Little things - part 1",
            "date": "July 23, 2021",
            "descriptions": "The tribe gets into little things that makes a difference in our finances, our success in the workplace, and in our relationships with friends and family. They drop some major keys and get into some rather overlooked tricks that can go a long way in achieving success and financial independence. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MzhhNTZkMWUtOGU4Yi00OWMwLWI2ZDktMjhhZWY4ZWIzMzc1?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/5WocJGdrTsYutD9lSqsJZe",
                "applePodcast": "https://podcasts.apple.com/us/podcast/20-little-things-part-1/id1553517709?i=1000529781220"
            }
        },
        {
            "title": " Summer FLIX",
            "date": "July 15, 2021",
            "descriptions": "The tribe goes through the 2021 movie release calendar from January to December and review the ones that have been released and also share their thoughts on the forthcoming ones. Afia celebrates Messi's Copa America win and shuts the guys up about the \"Messi is the GOAT\" argument. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MTliNWNiYjQtMDdiOS00NTI4LTliZDEtMmFjYzQ5Yjg1YTNi?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/0GQ717PV3M638vgfAWpVDr",
                "applePodcast": "https://podcasts.apple.com/us/podcast/19-summer-flix/id1553517709?i=1000528936606"
            }
        },
        {
            "title": " Delayed reactions",
            "date": "July 10, 2021",
            "descriptions": "The tribe gets into the 2021 Vodafone Ghana Music awards (VGMA) and rate the categories, winners, and performances. Kwadwo talks about his trip to Ghana and get into some of the development news in Ghana. The tribe gives their take on the 1 district 1 factory initiative in Ghana and suggest ways it can be improved. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MDEzODk1ZTctZDkyMi00NjdiLTlkZTctMjUxMWM4MzJlYmIz?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/6RxSsvoQScjB1ABnX5kDum",
                "applePodcast": "https://podcasts.apple.com/us/podcast/18-delayed-reactions/id1553517709?i=1000528435571"
            }
        },
        {
            "title": " Ghana Kasa",
            "date": "June 28, 2021",
            "descriptions": "In the first episode of Kasa recorded on the motherland, Kwadwo sits down with four new tribe members to discuss rewards of their careers. They share some of their experiences on the non-monetary rewards of work and teaching. Meet the new tribe members;Jemima - (IG - @yaa_ampong , T - @YaaAmponggg)Mina - (IG - @minapokuagyemang , T - @Mz.Scaizy)Kobby - (IG - @quolby , T - @quolby)Kwabena - (IG - @__cobe_jr , T - @Deekayyy3)The tribe also explores whether it is smart to stay in touch with an ex when you are in a committed relationship. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YWQwODE5MzAtYzAxMC00MTIxLTkyYTYtODgzZTdkMTI3MTU1?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/7DrJf7eYxyngl4F6tlMX0S",
                "applePodcast": "https://podcasts.apple.com/us/podcast/17-ghana-kasa/id1553517709?i=1000527169848"
            }
        },
        {
            "title": " Tell me your story, John",
            "date": "June 04, 2021",
            "descriptions": "Kwadwo sits down with a tech entrepreneur, John Oamen, in a special episode to go through his journey from the streets to building a global tech brand.John shares so many great stories from his childhood, through his young adult life to his success as the CEO of CutStruct Technology Limited. He share so many nuggets of information that is bound to make you reach for a notepad and a pen!!You can connect with John Oamen onLinkedIn (https://www.linkedin.com/in/johnoamen/),Facebook (https://www.facebook.com/john.oamen.39)Instagram (https://www.instagram.com/johnoamen/)  ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YTFlOWM1NGQtNjRlNy00YjQxLTk4YWMtNDgyNmM3MWY0NmZl?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/0WcjHnxu6aLBCEbfbZpRuI",
                "applePodcast": "https://podcasts.apple.com/us/podcast/16-tell-me-your-story-john/id1553517709?i=1000524173920"
            }
        },
        {
            "title": " Let's Ted talk",
            "date": "May 27, 2021",
            "descriptions": "The tribe share some interesting and not so interesting Ted talks they've watched. They discuss the lessons they learned from these talks and give a recommendations list.1. How algorithms shape our world - Kevin Slavin (2011) [Justin]2. How to speak so that people want to listen - Julian Treasure (2013) [Chris]3. 5 Hinderances to self-mastery - Master Shi Heng Yi (2020) [Afia]4. How great leaders inspire action - Simon Sinek (2010) [Kwadwo]5. Paper towns and why learning is awesome - John Green (2015) [Justin]6. Unwavering focus - Dandapani (2016) [Afia]7. The danger of silence - Clint Smith (2014) [Justin]8. How to start a movement - Derek Sivers (2014) [Justin]9. 10 things you did not know about orgasms - Mary Reach (2010) {bad one!!!!}The tribe also give their predictions for the Europa league and Champions league finals!! ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/OWJmNDkwZmUtYzYyNi00MDJlLTk1YzgtN2U1NDIyMDQ4ODIy?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/1Kb2Yx0Lz9qlBTAPEojOdo",
                "applePodcast": "https://podcasts.apple.com/us/podcast/15-lets-ted-talk/id1553517709?i=1000523257114"
            }
        },
        {
            "title": " Books Books Books",
            "date": "May 20, 2021",
            "descriptions": "The tribe gets into a fascinating conversation on literature and help populate an impressive summer reading list.The books suggested include;1. Outliers - Malcolm Gladwell (Fausty)2. Think like a Monk - Jay Shetty (Saachi)3. The power and the glory - Graham Greene (Justin)4. The brothers Karamazov - Fyodor Dostoevsky (Kwadwo)5. The Fall - Albert Camus (Justin)6. Make your bed - William. H McRaven (Fausty)7. Becoming - Michelle Obama (Saachi)8. Choosing me before we - Christine Arylo (Saachi)9. Pretty is what changes - Jessica Queller (Justin)10. The 48 laws of power - Robert Greene (Kwadwo)11. Never look an American in the eye - Okey Ndibe (Justin)12. You can win - Shir Khera (Saachi)13. The secret - Rhonda Byrne (Fausty)14. The promised land - Barack Obama (Kwadwo)15. The republic - Plato (Kwadwo)they also have a good time talking about long words like antidisestablishmentarianism and pneumonoultramicroscopicsilicovolcanoconiosis.Enjoy!!! --- This…",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/M2ZmMTA5MmUtMDVhYS00ZDI2LTk4MjgtZTEwODY2ZjZmYjM5?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/3cJL5mzZGMC7mIjlmv34Ry",
                "applePodcast": "https://podcasts.apple.com/us/podcast/14-books-books-books/id1553517709?i=1000522595127"
            }
        },
        {
            "title": " Leadership - if not you; who?",
            "date": "May 13, 2021",
            "descriptions": "The tribe get into leadership and discuss the things that motivate leaders, the challenges leaders face and what it takes to be a good leader.\"Readers are leaders\" - Saachi.New Tribe members, Adam and Justin, bring their wealth of leadership experience to the table and also explore the news from Ghana, India and the US.There is also a giveaway in there somewhere!!! Enjoy!!! ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ZGUzODY4OGYtZjY3NC00MjFmLTkwMTMtZTk3NDFmYzkxM2Q2?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/6aKyi1alTdll04AgjViYyq",
                "applePodcast": "https://podcasts.apple.com/us/podcast/13-leadership-if-not-you-who/id1553517709?i=1000522166711"
            }
        },
        {
            "title": " See what I'm saying?",
            "date": "May 07, 2021",
            "descriptions": "The tribe gets into what it takes to be a good listener.\"Everybody who is listening to you is hearing you but not everyone who is hearing you is listening\"- Ekow\"A good listener sees what you can't say\" - Chris.Angel joins the tribe and drops so many great nuggets on improving our listening.There is also a mysterious pool party that has some tribe members salty......enjoy!!! ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YTliODA1ZTItY2JhMi00ZTA4LWFiMWUtYTYwNGJiM2YzMjQ5?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/03R0VpmrTjiNzBwj75WSZf",
                "applePodcast": "https://podcasts.apple.com/us/podcast/12-see-what-im-saying/id1553517709?i=1000522166710"
            }
        },
        {
            "title": " Not gonna stress it!",
            "date": "April 29, 2021",
            "descriptions": "The tribe gets into the various ways stress manifests in their personal lives and, without \"playing therapists\", trade ideas on how they manage their stress. They aim at filling your \"stress tool box\" with enough tools to help manage all the forms and levels of stress.They also get into the European Super league (ESL) debacle and celebrate the win for the \"little guys\"",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MDI1MDkwNmYtNDEyMS00ODZhLWEyYmQtODY0ZWUxNjE5NWU0?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/65ycNPk2K8E2giKIPGn1Tg",
                "applePodcast": "https://podcasts.apple.com/us/podcast/11-not-gonna-stress-it/id1553517709?i=1000519205308"
            }
        },
        {
            "title": " It's confidence, baby!!!",
            "date": "April 22, 2021",
            "descriptions": "The tribe takes a swing at the perceptions of confidence in the society as it pertains to gender. The explore the reasons why some actions are seen as \"confident\" when it's performed by men and \"arrogant\" when it comes from women. They trade ideas on how to empower people being pushed down and take a swing at some outdated concepts of gender roles.The tribe also weigh in on the treatment of Polio and share their take on the #freePoloo movement. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NTNhMTMxNTMtNWEyNi00MDY5LThlMDEtOThhZTM4MWJjMzRi?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/2aP3WH4gkNpfH0Sey2goei",
                "applePodcast": "https://podcasts.apple.com/us/podcast/10-its-confidence-baby/id1553517709?i=1000518231376"
            }
        },
        {
            "title": " Boundaries.....they're for me; not you!!",
            "date": "April 15, 2021",
            "descriptions": "Chris gets the tribe discussing boundaries in relationships this week with the question, \"should there even be boundaries anyway?\"So many lessons are shared on the need for boundaries and when to set boundaries. The tribe trades interesting issues they wouldn't compromise on in a relationship. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NTZkY2YyNzUtYzBlYS00MzA0LWI0NTctYzg0NDNhZmZjM2Zk?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/0lFPBmTwkRm064d7mgslyZ",
                "applePodcast": "https://podcasts.apple.com/us/podcast/9-boundaries-theyre-for-me-not-you/id1553517709?i=1000517203967"
            }
        },
        {
            "title": " Story story - The \"woes\" of match-making",
            "date": "April 08, 2021",
            "descriptions": "The gang trades stories on times they've been set up on \"match-made\" dates! It's not all horror stories though......some juicy beans are spilt!!Kwadwo hints at some good news and Dee finally budges on getting a vaccine!!Dee also takes a bold swing at the week's UCL games!!! ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/OTYyYjNhYTEtM2MwNy00YTJiLTk3YzMtMjFjODM2MTBkYTBk?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/6qdc1Eny9ToquM5HmPdqNR",
                "applePodcast": "https://podcasts.apple.com/us/podcast/8-story-story-the-woes-of-match-making/id1553517709?i=1000516226565"
            }
        },
        {
            "title": " What are you looking for?",
            "date": "April 01, 2021",
            "descriptions": "The tribe gets into things young people look for in friends and potential partners. A very heated conversation ensues and so much fun banter is thrown around.Saachi joins and shamelessly plugs the speakers' forum (https://twitter.com/tsf_lsu) and adds so much to the conversation.---This episode is sponsored by· Anchor: The easiest way to make a podcast.  https://anchor.fm/app",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/ZjZlYjgyMjItMGYwYi00ZmViLTk0ZjQtOGVjMTI4MzRlNzhj?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/4YbyA1SvSgDvskPc3a4fU4",
                "applePodcast": "https://podcasts.apple.com/us/podcast/7-what-are-you-looking-for/id1553517709?i=1000515381617"
            }
        },
        {
            "title": " Sorry.........what?",
            "date": "March 25, 2021",
            "descriptions": "The tribe takes a look at apologies from three main angles - first, second, and third persons. Afia starts the conversation of with a tricky question - \"can you apologize without saying 'I'm sorry'?\"Follow on twitter, IG and Facebook and let us know what you think.Did they also get into the Rastafarian issue???.......haha ---This episode is sponsored by· Anchor: The easiest way to make a podcast.  https://anchor.fm/app",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/MTRmNmFlZDgtOWI0Zi00YzhmLWIxOTctN2U2OTAyNGJhOTJk?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/0OJc1TTKvBTLk9XsYNVdrP",
                "applePodcast": "https://podcasts.apple.com/us/podcast/6-sorry-what/id1553517709?i=1000514383598"
            }
        },
        {
            "title": " Navigating the 20s (part 3) - Relationships",
            "date": "March 18, 2021",
            "descriptions": "The tribe get into the challenges young adults encounter in their 20s with their friend groups, romantic partners, and family. Papa Kow (https://www.instagram.com/nanaekownyarkson/) brings some lessons he learnt in his drama-filled week.The tribe gets into the champions league knockouts and trash Manchester United (as https://www.instagram.com/miss_afia_yeboah/ always does). ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NGEwZTM2YTktMjY0Ny00MzQ2LWJlZjgtNTNhOWQ3M2Y2ZWEz?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/11V6I0yn0CMOJs1yZYLn2G",
                "applePodcast": "https://podcasts.apple.com/us/podcast/5-navigating-the-20s-part-3-relationships/id1553517709?i=1000513601943"
            }
        },
        {
            "title": " Navigating the 20s (part 2) - Career",
            "date": "March 04, 2021",
            "descriptions": "The Tribe gets into the challenges associated with beginning the career journey, they talk about job interviews, first days on the job, and managing the work-life balance. They share their experiences with career related issues and drop some helpful tips for people about to get started on their own career journeys and those already in their chosen professions.Dee's predictions are reviewed and she makes two more bold ones.",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/NTgyMTNlM2YtNDYxOC00ZjNhLTk2N2ItNGQyZDFmZTdlNTlk?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/3xKcz40sjFWZJc4Xybx2Rw",
                "applePodcast": "https://podcasts.apple.com/us/podcast/4-navigating-the-20s-part-2-career/id1553517709?i=1000511586590"
            }
        },
        {
            "title": " Navigating the 20s (part 1) - College",
            "date": "February 25, 2021",
            "descriptions": "The tribe gets into the challenges young adults face in their 20s. They share their college experiences and trade tips they used to navigate the college space - academically and socially.Dee also keeps predicting sports outcomes and makes 10 EPL predictions---This episode is sponsored by· Anchor: The easiest way to make a podcast.  https://anchor.fm/app",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/YjlhODNlMTktMDgxZC00MzUyLWI3N2QtZGQzODA4YjFkZjYz?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/0k2cW9iFkLhc9z8mv68Hld",
                "applePodcast": "https://podcasts.apple.com/us/podcast/3-navigating-the-20s-part-1-college/id1553517709?i=1000510552548"
            }
        },
        {
            "title": " Tell me about Valentine",
            "date": "February 19, 2021",
            "descriptions": "The tribe gets into ideas for celebrating Valentine's Day; discuss movies and tv shows; and evaluate one another's playlists on Apple Music. Afia's playlist emerges as the best curated playlist give her a follow on Apple Music (@afia_y) and check it out.Dee also predicts sports results again!! ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/N2U1MjdiNzAtNTBkZi00MjBhLTlhNTktYmMzMjczMDU2NmQ3?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/6YraVYePLilf9DoDznTpQK",
                "applePodcast": "https://podcasts.apple.com/us/podcast/2-tell-me-about-valentine/id1553517709?i=1000509760985"
            }
        },

        {
            "title": " First dates",
            "date": "February 12, 2021",
            "descriptions": "The tribe get into first date experiences and trade helpful first date tips.Kwadwo (@just_quajjo) is joined by Afia (@ephya_yeboah), Ekow (@NNyarkson), Dyna (@gistwithdee) and Chris (@chris_kuetsinya)!!The crew also give their Super Bowl predictions. ",
            "links": {
                "googlePodcast": "https://podcasts.google.com/feed/aHR0cHM6Ly9hbmNob3IuZm0vcy80YzY2MDEzOC9wb2RjYXN0L3Jzcw/episode/OGIxOWMwMmQtZGQ5Ni00YTRmLWEwZTMtM2VhZjgyNTFiZGI2?sa=X&ved=2ahUKEwjy7_6Ay5_9AhUdkCcCHTX7CYQQkfYCegQIARAF",
                "spotify": "https://open.spotify.com/episode/07U2vQPoIQl5du6k81DJVR",
                "applePodcast": "https://podcasts.apple.com/us/podcast/1-first-dates/id1553517709?i=1000508788831"
            }
        }
    ]
}